/* No comment provided by engineer. */
"Authenticating as {0}" = "Uwierzytelnianie jako {0}";
"Calculate checksum for {0}" = "Oblicz sumę kontrolną dla {0}";

"Deleting {0}" = "Kasowanie {0}";
"Downloading {0}" = "Pobieranie {0}";

/* Reading size of file. */
"Getting size of {0}" = "Sprawdzanie rozmiaru {0}";

/* Reading modification date of file. */
"Getting timestamp of {0}" = "Sprawdzanie daty {0}";

/* Reading permission of file. */
"Getting permission of {0}" = "Sprawdzanie uprawnień {0}";

/* No activity */
"Idle" = "Bezczynny";
"Listing directory {0}" = "Wyświetlanie zawartości katalogu {0}";
"Making directory {0}" = "Tworzenie katalog {0}";
"Maximum allowed connections exceeded. Waiting" = "Maksymalna liczba połączeń przekroczona. Oczekiwanie…";
"Mounting {0}" = "Montowanie {0}";

/* The user did not accept the certificate or is not valid */
"No trusted certificate found" = "Nie odnaleziono bezpiecznego certyfikatu";

"Opening {0} connection to {1}" = "Otwieranie połączenia {0} do {1}";
/* Connection type opened */
"{0} connection opened" = "Połączenie {0} otwarte";
"Disconnected" = "Rozłączony";
"Disconnecting {0}" = "Rozłączanie {0}";

"SFTP subsystem ready" = "Podsystem SFTP gotowy";
"SCP subsystem ready" = "Podsystem SCP gotowy";
"Starting SFTP subsystem" = "Uruchamianie podsystemu SFTP";
"Starting SCP subsystem" = "Uruchamianie podsystemu SCP";

"Uploading {0}" = "Wysyłanie {0}";

/* Renaming file status message; Renaming to <new filename>. */
"Renaming {0} to {1}" = "Zmiana nazwy {0} na {1}";

/* Duplicate a file */
"Copying {0} to {1}" = "Kopiowanie {0} do {1}";

/* Changing the owner of a file */
"Changing owner of {0} to {1}" = "Zmiana właściciela {0}na {1}";

/* Changing the group owner of a file */
"Changing group of {0} to {1}" = "Zmiana grupy {0} na {1}";

/* Changing UNIX file permissions */
"Changing permission of {0} to {1}" = "Zmiana uprawnień {0} na {1}";
"Changing timestamp of {0} to {1}" = "Zmiana sygnatury czasowej z {0} na {1}";

/* Indicates remaining time needed for files to transfer */
"{0} seconds remaining" = "Pozostało sekund: {0}";

/* Indicates remaining time needed for files to transfer */
"{0} minutes remaining" = "Pozostało minut: {0}";

/* Indicates remaining time needed for files to transfer */
"{0} hours remaining" = "Pozostało godzin: {0}";

/* When trying to determine the IP address of a server hostname; e.g. Resolving example.net */
"Resolving {0}" = "Rozwiązywanie nazwy {0}";

/* Retry in 10 seconds - Used to indicate the time left until another connection attempt is made */
"Retry again in {0} seconds ({1} more attempts)" = "Ponowna próba za {0} sekund (jeszcze {1} prób)";
"Transfer complete" = "Transfer zakończony";
"Transfer incomplete" = "Transfer niekompletny";

/* Content distribution network (CDN) */
"Enable {0} Distribution" = "Wyłącz dystrybucję {0} ";
"Disable {0} Distribution" = "Wyłącz dystrybucję {0} ";

/* Compress and expand archives */
"Archiving {0}" = "Archiwizuję {0}";
"Unarchiving {0}" = "Wypakowuję {0}";

/* Compute MD5 hash */
"Compute MD5 hash of {0}" = "Oblicz skrót MD5 {0}";

/* Reading HTTP headers */
"Reading metadata of {0}" = "Odczytywanie metadanych {0}";

/* Writing custom HTTP headers */
"Writing metadata of {0}" = "Zapisywanie metadanych {0}";

/* Prepare path for transfer */
"Prepare {0} ({1})" = "Przygotuj {0} ({1})";
/* Progress message when concatenating files of segmented transfer */
"Finalize {0}" = "Zakończ {0}";

/* Content distribution network (CDN) configuration */
"Reading CDN configuration of {0}" = "Odczytywanie konfiguracji CDN dla {0} ";
"Writing CDN configuration of {0}" = "Zapisywanie konfiguracji CDN dla {0} ";

/* Growl Notification */
"Connection failed" = "Połączenie nieudane";

/* Growl Notification */
"Connection opened" = "Połączenie otwarte";

/* Growl Notification */
"Download complete" = "Pobieranie zakończone";

/* Growl Notification */
"Synchronization complete" = "Synchronizacja zakończona";

/* Growl Notification */
"Upload complete" = "Wysyłanie zakończone";

/* Growl Notification */
"Download failed" = "Pobieranie nieudane";

/* Growl Notification */
"Upload failed" = "Wysyłanie nieudane";

/* Growl Notification */
"Transfer queued" = "Transfer w kolejce";
